void main() {
  // for (int i = 0; i < 10; i++) {
  //   print(i);
  // }

  //decrement
  // for(int i = 10; i >= 1; i--){
  //   print(i);
  // }

  // ১ থেকে ২০ পর্যন্ত শুধু জোড় সংখ্যা প্রিন্ট করো (for লুপ)
  // for (int i = 1; i <= 20; i++) {
  //   if (i % 2 == 0) {
  //     print(i);
  //   }
  // }
  //

  /// ১ থেকে ২০ পর্যন্ত শুধু bijor সংখ্যা প্রিন্ট করো (for লুপ)
  // for (int i = 1; i <= 20; i ++) {
  //   // print(i);
  //   if (i % 2 == 1) {
  //     print(i);
  //   }
  // }

  ///১ থেকে ১৫ পর্যন্ত শুধু বিজোড় সংখ্যা প্রিন্ট করো (for লুপ)
  // for (int i = 1; i <= 15; i++) {
  //   if (i % 2 == 1) {
  //     print(i);
  //   }
  // }

//   ৫ এর গুণিতক টেবিল প্রিন্ট করো
// (ফরম্যাট: ৫ × ১ = ৫
// ৫ × ২ = ১০
// …
// ৫ × ১০ = ৫০)
// (for লুপ ব্যবহার করে

  // int num = 5;
  //
  // for (int i = 1; i <= 10; i++) {
  //   int result = num * i;
  //   print('$num * $i = $result');
  // }

  //১ থেকে ১০ পর্যন্ত সব সংখ্যার যোগফল বের করে প্রিন্ট করো
  // (উত্তর হওয়া উচিত: ৫৫)
  // int sum = 0;
  // for (int i = 1; i <= 10; i++) {
  //   sum = sum + i;
  // }
  // print(sum);

  // ৬ এর ফ্যাক্টরিয়াল বের করে প্রিন্ট করো
  // (উত্তর হওয়া উচিত: ৭২০)
  /**int fact = 1;
      for (int i = 1; i <= 6; i++) {
      // print(i);
      fact = fact * i;
      }
      print(fact);
   **/

  //১ থেকে ৩০ পর্যন্ত ৩ দিয়ে বিভাজ্য সব সংখ্যা প্রিন্ট করো
  // (অর্থাৎ: ৩, ৬, ৯, ১২, … ৩০)
  /**
      }**/

  //১ থেকে ৫০ পর্যন্ত সব জোড় সংখ্যার যোগফল বের করো এবং প্রিন্ট করো
  /**int sum = 0;
      for (int i = 1; i <= 50; i++) {
      if (i % 2 == 0) {
      sum += i;
      }
      }
      print(sum); **/

  //১ থেকে ১০০ পর্যন্ত ৫ দিয়ে বিভাজ্য কয়টা সংখ্যা আছে — সংখ্যাটা প্রিন্ট করো
  /**int count = 0;
      for (int i = 1; i <= 100; i++) {
      if (i % 5 == 0) {
      count++;
      }
      }
      print(count);**/

  // print("২ থেকে ৫০ পর্যন্ত প্রাইম সংখ্যাগুলো হলো : ");
  //
  // for (int i = 2; i <= 50; i++) {
  //   bool isPrime = true; // আমরা ধরে নিচ্ছি i একটি প্রাইম সংখ্যা
  //
  //   // ভেতরের লুপটি চেক করবে i-কে ২ থেকে i-এর আগের কোনো সংখ্যা দিয়ে ভাগ করা যায় কি না
  //   for (int j = 2; j < i; j++) {
  //     if (i % j == 0) {
  //       isPrime = false; // যদি ভাগ যায়, তবে এটি প্রাইম নয়
  //       break; // আর চেক করার দরকার নেই, লুপ থেকে বের হয়ে যাও
  //     }
  //   }
  //
  //   // যদি পুরো লুপ শেষেও isPrime ট্রু থাকে, তবে সংখ্যাটি প্রিন্ট করো
  //   if (isPrime) {
  //     print(i);
  //   }
  // }

  int rows = 5; // মোট কয়টি লাইন হবে

  for (int i = 1; i <= rows; i++) {
    String stars = "";
    // print(i);

    for (int j = 1; j <= i; j++) {
      print(i);
      stars += "*"; // i এর মান যত, ততগুলো স্টার যোগ হবে
    }

    print(stars); // লাইনটি প্রিন্ট করো
  }
}
